{
  "name": "Felipe Frantz Zanini",
  "description": "Senior Software Engineer in Pelotas, Brazil",
  "toast": "Text copied to clipboard",
  "icos": {
    "mail": "Send email",
    "bio": "Copy bio",
    "pdf_click": "Download PDF",
    "pdf_loading": "Loading..."
  },
  "about": {
    "title": "About",
    "description": "My software development journey began in 2008, during my technical education. In 2010, I completed the course and started my first programming internship — since then, I’ve been continuously growing in the field. After being hired as a software engineer still in 2010, I worked on more than 50 projects, focusing on PHP, JavaScript, and various other programming languages and libraries. Driven by my passion for technology and to keep improving, I earned a degree in IT Management, a specialization in Strategic IT Planning, and began a Master’s in Computer Science."
  },
  "experience": {
    "title": "Experience",
    "information": [
      {
        "id": 1,
        "initial_date": "2021",
        "final_date": "Present",
        "title": "Senior Software Engineer & Tech Lead at nav9 ➚",
        "link": "https://nav9.tech",
        "description": "Responsible for developing Frontend projects for the company’s clients, also working as a consultant and tech lead. I apply best practices and clean code for market-leading Brazilian companies such as Shoppings Iguatemi, UFC, EducaCross, Grupo SEB, Rede AZ, among others. I use top industry technologies, focusing especially on React, Next, and TypeScript, to bring innovation and quality to the projects I’m involved in."
      },
      {
        "id": 2,
        "initial_date": "2020",
        "final_date": "2021",
        "title": "CAPES Master's Scholarship at UFPel ➚",
        "link": "https://portal.ufpel.edu.br/en/",
        "description": "I was responsible for expanding the simulator developed and used by the research group for modeling and simulation of Wireless Sensor Networks (WSNs). Using real data collected by traps designed by the group, we simulated their behavior in natural environments, allowing us to obtain information on battery life, data collection capacity, communication range between traps, and their coverage. The Eboracum simulator was mainly developed and extended in Java. We published two scientific articles on this work: one focused on <b><u><a href='https://ieeexplore.ieee.org/document/8116572' target='_blank'>performance and energy consumption</a></u></b>, and another on <b><u><a href='https://eventos.unipampa.edu.br/sbiagro/files/2021/11/sbiagro2021-anais.pdf#page=219' target='_blank'>simulation and modeling of a WSN</a></u></b>."
      },
      {
        "id": 3,
        "initial_date": "2016",
        "final_date": "2020",
        "title": "Founder & CTO at Alpago ➚",
        "link": "https://wp.ufpel.edu.br/conectar/?s=alpago",
        "description": "ALPAGO was created to support the organization and communication of the sheep farming production chain, addressing two historic problems still affecting the sector. In 2016, the startup was incubated at Conectar, and in 2017, it graduated at the <b><u><a href='https://www.inovativa.online/aceleradas-e-graduadas-inovativa/' target='_blank'>Inovativa Brasil</a></u></b> event, standing out for its relevance. The sustainability of sheep farming depends on systemic coordination actions across the entire chain.\nI was responsible for system development, which included: requirements gathering, feasibility assessment, documentation, design, development, methodology selection, and testing. I also interacted with users and partners to get feedback on the system, continuously generating more value for the community.\nThe main technologies used were: PHP with CodeIgniter framework, HTML5, CSS3 with Bootstrap, JavaScript and MySQL."
      },
      {
        "id": 4,
        "initial_date": "2010",
        "final_date": "2015",
        "title": "Software Engineer at ZapShop Informática ➚",
        "link": "https://zapshop.com.br/sobre/",
        "description": "I was responsible for handling client requests in development, analyzing proposed systems, creating documentation, and developing customized solutions. I also provided client training, trained new team members, and performed system maintenance and testing.\nMain technologies used: Visual Basic, PHP with CodeIgniter, Laravel and CakePHP frameworks, HTML5, CSS3 with Bootstrap and Material‑UI, JavaScript and MySQL."
      }
    ]
  },
  "education": {
    "title": "Education",
    "information": [
      {
        "id": 1,
        "initial_date": "2019",
        "final_date": "Incomplete",
        "title": "Master’s in Computer Science at UFPel ➚",
        "link": "https://portal.ufpel.edu.br/en/",
        "region": "Pelotas, Brazil"
      },
      {
        "id": 2,
        "initial_date": "2014",
        "final_date": "2015",
        "title": "Specialization in IT Management at IDEAU ➚",
        "link": "https://www.bage.ideau.com.br/",
        "region": "Bagé, Brazil"
      },
      {
        "id": 3,
        "initial_date": "2011",
        "final_date": "2013",
        "title": "Bachelor’s Degree in IT Management at URCAMP ➚",
        "link": "https://urcamp.edu.br/",
        "region": "Caçapava do Sul, Brazil"
      },
      {
        "id": 4,
        "initial_date": "2008",
        "final_date": "2010",
        "title": "Technical Course in Computer Science at URCAMP ➚",
        "link": "https://urcamp.edu.br/",
        "region": "Dom Pedrito, Brazil"
      }
    ]
  },
  "certifications": {
    "title": "Certifications",
    "information": [
      {
        "id": 1,
        "initial_date": "2022",
        "final_date": "2022",
        "title": "CS50’s Web Programming with JavaScript",
        "region": "Harvard University"
      },
      {
        "id": 2,
        "initial_date": "2021",
        "final_date": "2021",
        "title": "BootCamp Ignite",
        "region": "RocketSeat"
      }
    ]
  },
  "skills": {
    "title": "Skills",
    "information": [
      {
        "id": 1,
        "title": "JavaScript",
        "desciption": "Over the past three years, I’ve focused on this programming language. I use it in frontend development with React, mainly using the Next.js framework. I’ve also worked on projects with other frameworks like Angular and Vue. Additionally, I’m using it to improve my test automation skills with Jest."
      },
      {
        "id": 2,
        "title": "PHP",
        "desciption": "I have extensive experience with my 'native' programming language, with over 10 years of practice. Throughout my career, I’ve used and continue to use this language in various applications. In development, I built APIs and large systems using CodeIgniter and Laravel frameworks. I’ve also worked with relational databases like MySQL and non-relational ones like MongoDB."
      }
    ]
  },
  "language": {
    "title": "Languages",
    "information": [
      {
        "id": 1,
        "title": "Portuguese",
        "desciption": "Understands well, speaks well, reads well, writes well"
      },
      {
        "id": 2,
        "title": "English",
        "desciption": "Understands well, speaks moderately, reads well, writes moderately"
      },
      {
        "id": 3,
        "title": "Spanish",
        "desciption": "Understands moderately, speaks moderately, reads moderately, writes moderately"
      }
    ]
  }
}
