{
  "name": "Felipe Frantz Zanini",
  "description": "Ingeniero de Software Senior en Pelotas, Brasil",
  "toast": "Texto copiado al portapapeles",
  "icos": {
    "mail": "Enviar correo",
    "bio": "Copiar biografía",
    "pdf_click": "Descargar PDF",
    "pdf_loading": "Cargando...",
    "pdf_success": "PDF descargado correctamente"
  },
  "about": {
    "title": "Sobre mí",
    "description": "Mi trayectoria en el desarrollo de software comenzó en 2008, durante el curso técnico. En 2010, terminé la formación e inicié mi primera pasantía en programación — desde entonces, sigo trabajando y creciendo en el área. Contratado como ingeniero de software ese mismo año, he participado en más de 90 proyectos, utilizando lenguajes como PHP, JavaScript, Ruby, Python y otros lenguajes y bibliotecas. Actualmente, soy ingeniero de software senior en <b><a href='https://iguatemi.com.br/' target='_blank'>Iguatemi S.A</a></b>. <br /> Impulsado por la pasión por la tecnología y por seguir mejorando, cursé Gestión de Tecnología de la Información, una especialización en Planificación Estratégica en TI e inicié la Maestría en Ciencias de la Computación, que no llegué a concluir por motivos personales. Ante el avance de la tecnología y la inteligencia artificial, empecé a cursar un posgrado en IA y automatización, para mantenerme alineado con las demandas del mercado y seguir evolucionando en mi carrera."
  },
  "experience": {
    "title": "Experiencia",
    "information": [
      {
        "id": 1,
        "initial_date": "2021",
        "final_date": "Presente",
        "title": "Ingeniero de Software Senior y Tech Lead en nav9 ➚",
        "link": "https://nav9.tech",
        "description": "Responsable de desarrollar proyectos frontend para los clientes de la empresa, actuando también como consultor y líder técnico. Aplico buenas prácticas y código limpio para empresas de referencia en el mercado brasileño, como Shoppings Iguatemi, UFC, EducaCross, Grupo SEB y Rede AZ, entre otras. Utilizo React, Next y TypeScript como principales tecnologías para aportar innovación y calidad a los proyectos en los que participo."
      },
      {
        "id": 2,
        "initial_date": "2020",
        "final_date": "2021",
        "title": "Becario de Maestría CAPES en UFPel ➚",
        "link": "https://portal.ufpel.edu.br/en/",
        "description": "Responsable de ampliar el simulador desarrollado y utilizado por el grupo de investigación para modelado y simulación de Redes de Sensores Inalámbricos (WSN). A partir de datos reales recogidos por trampas diseñadas por el grupo, simulamos su comportamiento en entornos naturales, obteniendo información sobre duración de batería, capacidad de recolección, alcance de comunicación entre trampas y cobertura. El simulador Eboracum fue desarrollado y ampliado principalmente en Java. De este trabajo surgieron dos artículos científicos: uno sobre <b><u><a href='https://ieeexplore.ieee.org/document/8116572' target='_blank'>rendimiento y consumo de energía</a></u></b> y otro sobre <b><u><a href='https://eventos.unipampa.edu.br/sbiagro/files/2021/11/sbiagro2021-anais.pdf#page=219' target='_blank'>simulación y modelado de WSN</a></u></b>."
      },
      {
        "id": 3,
        "initial_date": "2016",
        "final_date": "2020",
        "title": "Fundador y CTO en Alpago ➚",
        "link": "https://wp.ufpel.edu.br/conectar/?s=alpago",
        "description": "ALPAGO fue creada para apoyar la organización y la comunicación de la cadena productiva de la ovinocultura, abordando dos problemas históricos del sector. En 2016, la startup fue incubada en Conectar y, en 2017, se graduó en el programa <b><u><a href='https://www.inovativa.online/aceleradas-e-graduadas-inovativa/' target='_blank'>Inovativa Brasil</a></u></b>, destacándose por su relevancia. La sostenibilidad de la ovinocultura depende de acciones que coordinen de forma sistémica todos los eslabones de la cadena.\nFui responsable del desarrollo del sistema, incluyendo levantamiento de requisitos, evaluación de viabilidad, documentación, diseño, desarrollo, definición de metodologías y pruebas. También mantuve contacto con usuarios y socios para obtener retroalimentación y generar valor continuo para la comunidad.\nPrincipales tecnologías: PHP con CodeIgniter, HTML5, CSS3 con Bootstrap, JavaScript y MySQL."
      },
      {
        "id": 4,
        "initial_date": "2010",
        "final_date": "2015",
        "title": "Ingeniero de Software en ZapShop Informática ➚",
        "link": "https://zapshop.com.br/sobre/",
        "description": "Responsable de atender a clientes en el área de desarrollo: análisis de los sistemas propuestos, elaboración de documentación y desarrollo de soluciones a medida. También impartí capacitación a clientes y nuevos colaboradores, además de realizar pruebas y mantenimiento de los sistemas.\nPrincipales tecnologías: Visual Basic, PHP con CodeIgniter, Laravel y CakePHP, HTML5, CSS3 con Bootstrap y Material-UI, JavaScript y MySQL."
      }
    ]
  },
  "education": {
    "title": "Educación",
    "information": [
      {
        "id": 1,
        "initial_date": "2025",
        "final_date": "Incompleto",
        "title": "Posgrado en Inteligencia Artificial y Automatización en RocketSeat ➚",
        "link": "https://rocketseat.com.br/",
        "region": "Remoto, Brasil"
      },
      {
        "id": 2,
        "initial_date": "2019",
        "final_date": "Incompleto",
        "title": "Maestría en Ciencias de la Computación en UFPel ➚",
        "link": "https://portal.ufpel.edu.br/en/",
        "region": "Pelotas, Brasil"
      },
      {
        "id": 3,
        "initial_date": "2014",
        "final_date": "2015",
        "title": "Especialización en Gestión de TI en IDEAU ➚",
        "link": "https://www.bage.ideau.com.br/",
        "region": "Bagé, Brasil"
      },
      {
        "id": 4,
        "initial_date": "2011",
        "final_date": "2013",
        "title": "Grado en Tecnología en Gestión de TI en URCAMP ➚",
        "link": "https://urcamp.edu.br/",
        "region": "Caçapava do Sul, Brasil"
      },
      {
        "id": 5,
        "initial_date": "2008",
        "final_date": "2010",
        "title": "Técnico en Informática en URCAMP ➚",
        "link": "https://urcamp.edu.br/",
        "region": "Dom Pedrito, Brasil"
      }
    ]
  },
  "certifications": {
    "title": "Certificaciones",
    "information": [
      {
        "id": 1,
        "initial_date": "2022",
        "final_date": "2022",
        "title": "CS50's Web Programming with JavaScript",
        "region": "Harvard University"
      },
      {
        "id": 2,
        "initial_date": "2021",
        "final_date": "2021",
        "title": "Bootcamp Ignite",
        "region": "Rocketseat"
      }
    ]
  },
  "skills": {
    "title": "Competencias técnicas",
    "information": [
      {
        "id": 1,
        "title": "JavaScript",
        "desciption": "Durante los últimos cinco años, me he dedicado a este lenguaje de programación. Lo utilizo en el desarrollo front-end con React, sobre todo con Next.js y con Vite, y he participado en proyectos con Angular y Vue. En el backend, Node.js y Express son mi combo favorito. También lo uso para mejorar la automatización de pruebas con Jest."
      },
      {
        "id": 2,
        "title": "PHP",
        "desciption": "Tengo amplia experiencia en mi lenguaje de programación \"de origen\", con más de diez años de práctica. A lo largo de mi carrera, he utilizado y sigo utilizando PHP en diversas aplicaciones: APIs y sistemas de gran escala con los frameworks CodeIgniter y Laravel, además de bases de datos relacionales (MySQL) y no relacionales (MongoDB)."
      }
    ]
  },
  "language": {
    "title": "Idiomas",
    "information": [
      {
        "id": 1,
        "title": "Portugués",
        "desciption": "Comprensión: fluido · Habla: fluido · Lectura: fluido · Escritura: fluido"
      },
      {
        "id": 2,
        "title": "Inglés",
        "desciption": "Comprensión: fluido · Habla: intermedio · Lectura: fluido · Escritura: intermedio"
      },
      {
        "id": 3,
        "title": "Español",
        "desciption": "Comprensión: intermedio · Habla: intermedio · Lectura: intermedio · Escritura: intermedio"
      }
    ]
  }
}
